{
    "status": "OK",
    "request_id": "88d08446-6e8b-4e97-87f6-5c9ca7a14921",
    "parameters": {
        "asin": "B0DFMZMKFJ",
        "country": "US",
        "sort_by": "TOP_REVIEWS",
        "verified_purchases_only": false,
        "images_or_videos_only": false,
        "current_format_only": false,
        "star_rating": "ALL",
        "page": 1
    },
    "data": {
        "asin": "B0DFMZMKFJ",
        "country": "US",
        "domain": "www.amazon.com",
        "reviews": [
            {
                "review_id": "R11AO4Y5N8US8O",
                "review_title": "Everyone Needs To Read This Book",
                "review_comment": "This is a useful book because the author addresses topics that probably everyone deals with. Getting along with others is important. Also, by having positive interactions with others we free ourselves to be the best we can be. Mel Robbins does a good job of blending research based information with anecdotes. Mel is a great writer. Her style is conversational and warm. I am happy I bought this book because even though I have strived to be a good communicator with everyone, I do tend to try too hard at times. I need to learn to accept that I must accept what I cannot or should not try to change. I also bought a copy for a friend who was very excited to receive it because she had heard Mel discuss the \"Let Them\" theory on tv. If you are human, you will benefit in some way from her wisdom, which is research based.",
                "review_star_rating": "5",
                "review_link": "https://www.amazon.com/gp/customer-reviews/R11AO4Y5N8US8O",
                "review_author_id": "AGQ737IOZ5QW5QQD2NP7MVPRENPQ",
                "review_author": "D. Young",
                "review_author_url": "https://www.amazon.com/gp/profile/amzn1.account.AGQ737IOZ5QW5QQD2NP7MVPRENPQ/ref=cm_cr_othr_d_gw_tr?ie=UTF8",
                "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
                "review_images": [],
                "review_video": null,
                "review_date": "Reviewed in the United States on March 1, 2025",
                "is_verified_purchase": true,
                "helpful_vote_statement": "39 people found this helpful",
                "reviewed_product_asin": "B0DFMZMKFJ",
                "is_vine": false
            },
            {
                "review_id": "R2GBIBVIZ4V6ZF",
                "review_title": "amazing book no complaints",
                "review_comment": "This is probably one of the best books I have ever read. Everything is so relatable and she makes it so easy to visualize and make happen. I genuinely see so much difference in my outlook on life, especially right now where I am at. If you are thinking about getting it, DO IT. I promise you won't regret it.",
                "review_star_rating": "5",
                "review_link": "https://www.amazon.com/gp/customer-reviews/R2GBIBVIZ4V6ZF",
                "review_author_id": "AEE7Y2Y366BOGLPKKTGKMDWWOULQ",
                "review_author": "Karmen",
                "review_author_url": "https://www.amazon.com/gp/profile/amzn1.account.AEE7Y2Y366BOGLPKKTGKMDWWOULQ/ref=cm_cr_othr_d_gw_tr?ie=UTF8",
                "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
                "review_images": [],
                "review_video": null,
                "review_date": "Reviewed in the United States on April 7, 2025",
                "is_verified_purchase": true,
                "helpful_vote_statement": "15 people found this helpful",
                "reviewed_product_asin": "B0DFMZMKFJ",
                "is_vine": false
            },
            {
                "review_id": "R2LVH49HKSTQP6",
                "review_title": "Good and easy read",
                "review_comment": "I really have enjoyed reading time book- I’m almost done with it. Can be a tiny bit redundant but it’s a super easy read that keeps you engaged. Looking forward to finishing and possibly ordering more from this author.",
                "review_star_rating": "4",
                "review_link": "https://www.amazon.com/gp/customer-reviews/R2LVH49HKSTQP6",
                "review_author_id": "AELHHYAP3ADGY5SG5U4MBRKGYXYQ",
                "review_author": "Meghan Marie",
                "review_author_url": "https://www.amazon.com/gp/profile/amzn1.account.AELHHYAP3ADGY5SG5U4MBRKGYXYQ/ref=cm_cr_othr_d_gw_tr?ie=UTF8",
                "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
                "review_images": [],
                "review_video": null,
                "review_date": "Reviewed in the United States on April 16, 2025",
                "is_verified_purchase": true,
                "reviewed_product_asin": "B0DFMZMKFJ",
                "is_vine": false
            },
            {
                "review_id": "R3P2NVNWMFMGHP",
                "review_title": "What a great liberating book that comes at just the right time!",
                "review_comment": "I love this book so much! This book focuses on what I call the new liberation model versus the old model that was conditioned and programed into us that we currently find ourselves currently mirrored in with components of power, control, stress, fear, elitist, immaturity, righteousness, polarization, tribalism, narcissism, stubborn, rigid and/or chaos, negativity bias, over-thinking, complaining, know-it-all, judgmental, critical, egotistical (ego), selfish/group selfishness, contradictory, superiority, hypocritical, comparison, competitiveness, fighting & arguing, fragmented society, entitlement, perfectionism, identifying/over-identifying with your beliefs ideological, misery, victim mentality, we are right and your group is wrong/we are good and your group is bad, drama triangle & drama addiction, neuroticism, codependency, terrible at relationships (especially with people who think or believe differently than you and with people who can think outside of the current box/boxes), moral superiority, increased mental health issues, increased medical health issues, lots of news addiction, social media addiction, political addiction, political righteousness and political radicalness too.Thank you to those (like Mel Robbins) that are doing deeper mental health therapy work on themselves to be better human beings, transform themselves, and to be better version of themselves. Mel is a great example of a genuine, vulnerable, real, whole and authentic role model and a real leader in our society!Thank you to those humans, researchers and mental health/medical professionals/other professionals advocating for the newer integration model, newer liberation model, and self actualizing model Separation, siloed, & polarization group models never work long term, are very immature and go against the laws of nature.The other books that are like this are: \"Liberated Love\", \"Unhealthy Helping\", \"Beyond Anxiety\" and \"Dissolving the Ego\", \"The Way of Integrity\", \"On Fear\", \"Living Untethered\", \"No Bad Parts\" and \"The Book of Awakening\" or \"The Little Book of Awakening\".Remember, the younger generation is watching and witnessing all of this toxic & dysfunctional mess. Hopefully, the younger generation will learn from this and not be anything like the older generations.Please do us all a big favor and go work on yourselves with mental health therapy work. Working on yourself is the only true, real, authentic way to transform a society. Anything less, is just superficial, shallow, and surface level change. Pease look at my first paragraph and I think most humans will see many items in that first paragraph to work on in therapy.Most of the human traits in my first paragraph are terrible for your relationships and connections in general.It is interesting that the USA Western culture teaches and trains people to be in your own ego and (the ego is the highest priority) The USA mantra is \"Your own ego and what your ego or what the group ego wants is all that matters\" and \"I have all the answers\"(ego) where the Eastern culture has their highest attainment is enlightenment and self actualization and they teach their culture that: \"We do not have all the answers\" (humble). The Eastern mantra is \"Drop your own ego, practice non attachment and work towards self actualization and enlightenment\". I wonder what culture is doing better right now?You could also try a meditation class or a yoga class (or do one on youtube) to see if you can calm down your brain, body, mind, and your ego! It might also improve your relationships if you are in a calmer, flexible and more loving state of mind. Plus, you might gain more creative, innovative, and ingenuity problem solving skills (which the USA culture really seems to have rarity of these skills nowadays).It is interesting that the USA has so much moral superiority, righteousness, egotistical and a know-it-all attitude considering we have the worst education data, longevity data, medical conditions data, mental health data, prescription drug data, human trafficking data, suicide rates data, murder rates data than most of the 1st world countries.\"It Is No Measure of Health to Be Well Adjusted To a Profoundly Sick Society\"-Jiddu Krishnamurti",
                "review_star_rating": "5",
                "review_link": "https://www.amazon.com/gp/customer-reviews/R3P2NVNWMFMGHP",
                "review_author_id": "AFYQ3BW4L4CH5B3L72QOWSBU6K6Q",
                "review_author": "Out Of The Box Thinker",
                "review_author_url": "https://www.amazon.com/gp/profile/amzn1.account.AFYQ3BW4L4CH5B3L72QOWSBU6K6Q/ref=cm_cr_othr_d_gw_tr?ie=UTF8",
                "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
                "review_images": [],
                "review_video": null,
                "review_date": "Reviewed in the United States on January 21, 2025",
                "is_verified_purchase": true,
                "helpful_vote_statement": "99 people found this helpful",
                "reviewed_product_asin": "B0DFMZMKFJ",
                "is_vine": false
            },
            {
                "review_id": "R1P4VAXF7UUBP9",
                "review_title": "Strength in pages coffee table book",
                "review_comment": "This book is amazing. I have been reading it when I am struggling with people and rudeness. It has opened up to a new world and different levels of understanding to me!! Has been truly inspiring and helpful! Absolutely worth every penny!",
                "review_star_rating": "5",
                "review_link": "https://www.amazon.com/gp/customer-reviews/R1P4VAXF7UUBP9",
                "review_author_id": "AGLAVOM4ZVTTPZXJTBVXSXPC6B2A",
                "review_author": "C Collins",
                "review_author_url": "https://www.amazon.com/gp/profile/amzn1.account.AGLAVOM4ZVTTPZXJTBVXSXPC6B2A/ref=cm_cr_othr_d_gw_tr?ie=UTF8",
                "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
                "review_images": [],
                "review_video": null,
                "review_date": "Reviewed in the United States on April 16, 2025",
                "is_verified_purchase": true,
                "reviewed_product_asin": "B0DFMZMKFJ",
                "is_vine": false
            },
            {
                "review_id": "R15ZBVZLNXMBWV",
                "review_title": "Life-Changing Perspective – A Must-Read!",
                "review_comment": "The Let Them Theory is truly one of the best books I’ve ever read. It’s incredibly eye-opening and gave me a whole new perspective on life, relationships, and personal growth. The concept of simply “letting them” — whether that’s people leaving, behaving a certain way, or making their own choices — is so freeing. It teaches you to let go of control, stop taking things personally, and focus on your own peace.This book helped me understand the power of acceptance and the beauty in letting go. It’s written in such a relatable and gentle way, like a friend talking to you and guiding you toward emotional freedom. Every chapter felt like a breath of fresh air.If you’re struggling with anxiety, overthinking, or holding on too tightly to people or situations, this book is exactly what you need. It’s the kind of book you want to highlight, reread, and share with everyone you know. Absolutely a 10/10!",
                "review_star_rating": "5",
                "review_link": "https://www.amazon.com/gp/customer-reviews/R15ZBVZLNXMBWV",
                "review_author_id": "AEW7FAR7TKYZ3JRIMNYDS7IFDDIA",
                "review_author": "Amanda Fenech ",
                "review_author_url": "https://www.amazon.com/gp/profile/amzn1.account.AEW7FAR7TKYZ3JRIMNYDS7IFDDIA/ref=cm_cr_othr_d_gw_tr?ie=UTF8",
                "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/97fae8b3-92b0-4307-aba6-43c5d84d78c4._CR0,0,361,361_SX48_.jpg",
                "review_images": [],
                "review_video": null,
                "review_date": "Reviewed in the United States on April 8, 2025",
                "is_verified_purchase": true,
                "helpful_vote_statement": "8 people found this helpful",
                "reviewed_product_asin": "B0DFMZMKFJ",
                "is_vine": false
            },
            {
                "review_id": "R1DABMMJ03PLYW",
                "review_title": "Great book",
                "review_comment": "I am usually not the type to write a review. However after reading this book, I am so grateful I bought it. It is an easy read and has helped me a lot as a college senior struggling to find a path in the world. This book has helped me embrace the journey and to not let others dictate my emotions or actions. I have trying to implement let them and let me in my life and have found inner peace. thank you to everyone who worked on this book and brought a vision to life for others! Can't wait for the next read!",
                "review_star_rating": "5",
                "review_link": "https://www.amazon.com/gp/customer-reviews/R1DABMMJ03PLYW",
                "review_author_id": "AEEQHJU6X5HXELZXPY75TFFVKHOA",
                "review_author": "Shubhangi",
                "review_author_url": "https://www.amazon.com/gp/profile/amzn1.account.AEEQHJU6X5HXELZXPY75TFFVKHOA/ref=cm_cr_othr_d_gw_tr?ie=UTF8",
                "review_author_avatar": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
                "review_images": [],
                "review_video": null,
                "review_date": "Reviewed in the United States on March 31, 2025",
                "is_verified_purchase": true,
                "helpful_vote_statement": "2 people found this helpful",
                "reviewed_product_asin": "B0DFMZMKFJ",
                "is_vine": false
            }
        ]
    }
}